app/controllers/comments_controller.rb

  def create

    @comment = current_user.comments.new(params[:comment])
    @comment.post = @post

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "user_id") VALUES('2009-12-29 03:27:37', 'Опять это нытье на главной? Публичное место всё-таки.', '2009-12-29 03:27:37', NULL, 2)

    def load_post
      @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2) ORDER BY created_at desc