app/controllers/posts_controller.rb

  def index
    @posts = current_user.posts.paginate(:page => params[:page])
---
SELECT * FROM "posts" WHERE ("posts".user_id = 1) ORDER BY created_at desc LIMIT 30 OFFSET 0

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2) ORDER BY created_at desc

  def edit
    @post = current_user.posts.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2 AND ("posts".user_id = 1)) ORDER BY created_at desc

  def create
    @post = current_user.posts.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("slug", "preface", "created_at", "title", "body", "published", "updated_at", "user_id", "comments_count") VALUES(NULL, 'Рэй (Крис О''Дауд), Тоби (Марк Уотсон) и Пит (Дин Леннокс Келли) - типичные неудачники. Рэй работает в детском аттракционе "Звездная прогулка" - изображает из себя командира Земного корпуса мира. Впрочем, "работает" - немного неправильное слово, потому что Рэя оттуда только что уволили. Парень слишком сильно увлекался всей этой научной фантастикой, слишком круто входил в образ лихого бойца будущего, так что детишки плакали и уж точно не наслаждались аттракционом.

  def update
    @post = current_user.posts.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2 AND ("posts".user_id = 1)) ORDER BY created_at desc
UPDATE "posts" SET "updated_at" = '2009-12-29 01:52:32', "preface" = 'Сегодня я расскажу вам как я купил квартиру и 2 года плачу кредит, но до сих пор не живу в ней.', "body" = 'А всё очень просто. Всегда надо оставлять запас денег. Потому что у меня запаса не оказалось и ремонт я так и не могу закончить.