app/controllers/profiles_controller.rb

UPDATE "users" SET "updated_at" = '2009-12-30 23:38:06', "firstname" = 'Александр' WHERE "id" = 1
---
  def update
    respond_to do |format|
      if current_user.update_attributes(params[:user])