app/controllers/users_controller.rb

SELECT * FROM "users" ORDER BY posts_count desc, comments_count desc LIMIT 30 OFFSET 0
---
  def index
    @users = User.paginate :page=>params[:page], :order=>'posts_count desc, comments_count desc'

INSERT INTO "users" ("encrypted_password", "dob", "created_at", "avatar_file_name", "avatar_file_size", "confirmation_sent_at", "updated_at", "username", "url", "lastname", "posts_count", "sex", "password_salt", "avatar_content_type", "about", "reset_password_token", "remember_token", "firstname", "confirmation_token", "remember_created_at", "comments_count", "avatar_updated_at", "email", "confirmed_at") VALUES('fb6b4c683652658b7be0aa55a549e4cff51d673f', NULL, '2009-12-30 23:59:57', NULL, NULL, '2009-12-30 23:59:57', '2009-12-30 23:59:57', 't0tya', NULL, NULL, 0, NULL, 't8FPS9C0KHKrg82bxeDB', NULL, NULL, NULL, NULL, NULL, 'Y21Ttd8dw8tTKlyh5Veq', NULL, 0, NULL, 't0tya@yandex.ru', NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save